Source/Catalogs/Нейро_Слои.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>Нейро_Слои</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипСлоя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Нейро_ТипыСлоев</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСлоя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Нейро_ВидыСлоев</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеСлояАнг</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеСлояРус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеСсылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Source/Catalogs/Нейро_Слои/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//ОписаниеСлоя=?(ЯзыкОписания=0,Объект.ОписаниеСлояАнг, Объект.ОписаниеСлояРус);
	//Если ОписаниеСлоя<>"" Тогда
	//	Описание.УстановитьHTML(ОписаниеСлоя, Новый Структура);
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТипСлояПриИзменении(Элемент)
	Объект.ИдОбъекта=ПолучитьИдСлоя();
	ИзменитьНаименование();
	//ЭтаФорма.Прочитать();
КонецПроцедуры

Функция ПолучитьИдСлоя()
//	Возврат Нейро_ОбщийМодуль.ИдСлоя(Объект.ТипСлоя);
	Возврат Нейро_ОбщийМодуль.ПолучитьКомментарийИзЗначенияПеречисления("Нейро_ТипыСлоев", Объект.ТипСлоя);
КонецФункции

&НаСервере
Процедура ИзменитьНаименование()
	//Объект.Наименование = Нейро_ОбщийМодуль.ПолучитьИмяСлоя(Объект.ТипСлоя);
	Объект.Наименование = СокрЛП(Объект.ТипСлоя);
	//Объект.Наименование = Нейро_ОбщийМодуль.ПолучитьИмяИзЗначенияПеречисления("Нейро_ТипыСлоев", Объект.ТипСлоя);
КонецПроцедуры

&НаКлиенте
Процедура ТипСлояНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ДанныеВыбора=ПолучитьТипыСлояПоВидуСлоя();
КонецПроцедуры

&НаСервере
Функция ПолучитьТипыСлояПоВидуСлоя()
	Возврат Нейро_ОбщийМодуль.ПолучитьТипыСлояПоВидуСлоя(Объект.ВидСлоя)
КонецФункции

&НаКлиенте
Процедура ОписаниеПриИзменении(Элемент)
	Вложения=Новый Структура;
	Если ЯзыкОписания=0 Тогда
		Описание.ПолучитьHTML(Объект.ОписаниеСлояАнг, Вложения);
	ИначеЕсли ЯзыкОписания=1 Тогда
		Описание.ПолучитьHTML(Объект.ОписаниеСлояРус, Вложения);
	КонецЕсли;
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОписание(Команда)
	Если ЯзыкОписания=0 Тогда
		Объект.ОписаниеСлояАнг="";
	ИначеЕсли ЯзыкОписания=1 Тогда
		Объект.ОписаниеСлояРус="";
	КонецЕсли;
	Модифицированность=Истина;
	ПереключитьОписание();
КонецПроцедуры

&НаКлиенте
Процедура СохранитьОписание(Команда)
	Режим = РежимДиалогаВыбораФайла.Сохранение;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	//ДиалогОткрытияФайла.Каталог=Файл.Путь;
	ДиалогОткрытияФайла.ПолноеИмяФайла = Объект.Наименование+".htm";
	Фильтр = "Гипертекстовый документ (*.htm)|*.htm";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.Заголовок = "Сохранить описание";	
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ОпОп = Новый ОписаниеОповещения("ПослеЗакрытияДиалогаВыбораВыходногоФайла", ЭтотОбъект);
	ДиалогОткрытияФайла.Показать(ОпОп);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияДиалогаВыбораВыходногоФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	Если ВыбранныеФайлы=Неопределено Тогда Возврат КонецЕсли;
	ОписаниеСлоя=""; Вложения=Новый Структура;
	Описание.ПолучитьHTML(ОписаниеСлоя, Вложения);
	ЗаписьТекста = Новый ЗаписьТекста(ВыбранныеФайлы[0], КодировкаТекста.ANSI);
	ЗаписьТекста.Записать(ОписаниеСлоя);
	ЗаписьТекста.Закрыть();	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОписание(Команда)
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	Фильтр = "Гипертекстовый документ (*.htm;*.html)|*.htm;*.html";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.Заголовок = "Загрузить описание";	
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ОпОп = Новый ОписаниеОповещения("ПослеЗакрытияДиалогаВыбораВходногоФайла", ЭтотОбъект);
	ДиалогОткрытияФайла.Показать(ОпОп);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияДиалогаВыбораВходногоФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	Если ВыбранныеФайлы=Неопределено Тогда Возврат КонецЕсли;
	ЧтениеТекста = Новый ЧтениеТекста(ВыбранныеФайлы[0]);
	Если ЯзыкОписания=0 Тогда
		Объект.ОписаниеСлояАнг = ЧтениеТекста.Прочитать();
	ИначеЕсли ЯзыкОписания=1 Тогда
		Объект.ОписаниеСлояРус = ЧтениеТекста.Прочитать();
	КонецЕсли;
	ЧтениеТекста.Закрыть();
	ПереключитьОписание();
	Модифицированность=Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЯзыкОписанияПриИзменении(Элемент)
	ПереключитьОписание();
КонецПроцедуры

&НаСервере
Процедура ПереключитьОписание()
	//ОписаниеСлоя=?(ЯзыкОписания=0,Объект.ОписаниеСлояАнг, Объект.ОписаниеСлояРус);
	//Если ОписаниеСлоя<>"" Тогда
	//	Описание.УстановитьHTML(?(ЯзыкОписания=0,Объект.ОписаниеСлояАнг, Объект.ОписаниеСлояРус), Новый Структура);
	//КонецЕсли;
	Описание.УстановитьHTML(?(ЯзыкОписания=0,Объект.ОписаниеСлояАнг, Объект.ОписаниеСлояРус), Новый Структура);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПереключитьОписание();
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеСсылкаОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Если Объект.ОписаниеСсылка<>"" Тогда
		НачатьЗапускПриложения(Новый ОписаниеОповещения, Объект.ОписаниеСсылка);
	КонецЕсли;
КонецПроцедуры
